app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('Gopi Krishna', NULL, '2010-02-10 06:48:35', NULL, NULL, 1146713906, NULL, NULL, 'facebooker_1146713906', '', '2010-02-10 06:48:35')
---
  def link_user_accounts
    #~ render :text => self.current_user and return

  if self.current_user.nil?
    #register with fb
    User.create_from_fb_connect(facebook_session.user)